In [1]:
import pandas as pd

### Pandas Sort Values
Sort Values will help you sort a DataFrame (or series) by a specific column or row. Let's take a look at some examples:
1. Sort DataFrame by a *single* column
2. Sort DataFrame by *mulitple* columns
3. Sort DataFrame by a single row
4. Apply a key to sort on - Example: Sort by absolute value

First, let's create our DataFrame of city temperatures

In [2]:
df = pd.DataFrame.from_dict({
     "San Francisco": [67, 72, 49, 56],
     "Chicago": [102, 75, 80, -3],
     "Fairbanks": [45, 5, -10, 80],
     "Miami": [67, 87, 90, 75]
    })
df

   San Francisco  Chicago  Fairbanks  Miami
0             67      102         45     67
1             72       75          5     87
2             49       80        -10     90
3             56       -3         80     75

### Sort DataFrame by a single column
In order to sort a dataframe by a single column, all you need to do is call YourDataFrame.sort_values('your_column')

In this case let's sort our DataFrame by Miami temperatures

In [11]:
df.sort_values('Miami')

   San Francisco  Chicago  Fairbanks  Miami
0             67      102         45     67
3             56       -3         80     75
1             72       75          5     87
2             49       80        -10     90

Notice how it sorted the DataFrame by the Miami column *lowest to highest.* This is because the default sort order is ascending=True. If you wanted to reverse order, you can set ascending=False.

In [4]:
df.sort_values('Miami', ascending=False)

   San Francisco  Chicago  Fairbanks  Miami
2             49       80        -10     90
1             72       75          5     87
3             56       -3         80     75
0             67      102         45     67

### Sort DataFrame by *multiple* columns

In order to sort by multiple columns, I'm going to create another DataFrame that will work better

In [12]:
df2 = pd.DataFrame.from_dict({
     "500 Club": ["Bar", 34.64],
     "Liho Liho": ["Restaurant", 200.45], 
     "Foreign Cinema": ["Restaurant", 180.45],
     "The Square": ["Bar", 45.54]
    }, orient='index', columns=['Type', 'AvgBill'])
df2

                      Type  AvgBill
500 Club               Bar    34.64
Liho Liho       Restaurant   200.45
Foreign Cinema  Restaurant   180.45
The Square             Bar    45.54

Now say that I wanted to first sort 'Type' alphabetically (so that Bar is on top of Restaurant), then descending order (highest > lowest) for AvgBill. In order to do this I need to 
1. Pass a list of column names into the "by=" parameter and
2. Pass a list of booleans into the "ascending" parameter that tells pandas which columns I want ascending vs descending

In [6]:
df2.sort_values(by=['Type', 'AvgBill'], ascending=[True, False])

                      Type  AvgBill
The Square             Bar    45.54
500 Club               Bar    34.64
Liho Liho       Restaurant   200.45
Foreign Cinema  Restaurant   180.45

Notice how I sorted ascending=True for first column 'Type', then ascending=False for the second column 'AvgBill'

### Sort DataFrame by a single row
Now let's move over to the row side. Infrequently, I want to sort my columns in a specific order (I'm more of a tall table person than wide table person, so this doesn't happen often).

In order to do this, I need to tell pandas that I want to sort by rows and which row I want to sort by. Let's return to our original DataFrame. I'm going to sort by the index=3 label.

To do this, I need to set axis=1

In [13]:
df

   San Francisco  Chicago  Fairbanks  Miami
0             67      102         45     67
1             72       75          5     87
2             49       80        -10     90
3             56       -3         80     75

In [14]:
df.sort_values(by=3, axis=1)

   Chicago  San Francisco  Miami  Fairbanks
0      102             67     67         45
1       75             72     87          5
2       80             49     90        -10
3       -3             56     75         80

Now the columns of my DataFrame have been sorted by index=3 in ascending order!

#### Sort Columns By Special Key

In this case, I want to sort my column by the absolute value of it's contents. Check out Fairbanks, right now -10 is the lowest value, however I'll sort on the absolute value so that 5 appears on top.

What is happening under the hood? Pandas is applying a function (much like [pandas apply](https://dataindependent.com/pandas/pandas-apply/)) to each column value. The result of that function will be the thing (or key) that will be sorted on.

In [15]:
df.sort_values(by='Fairbanks', key=pd.Series.abs)

   San Francisco  Chicago  Fairbanks  Miami
1             72       75          5     87
2             49       80        -10     90
0             67      102         45     67
3             56       -3         80     75

Now check out how we sorted on Fairbanks with the lowest numbers on top (ascending), and the value 5 is above the value -10. This is because we supplied the key to be the absolute value of the column contents!

Unfortunately, you can't call multiple key functions if you're using multiple columns. You'll need to apply the same function to all columns you're sorting on.